Tekla Open API Reference for Tekla Structures 2025
Drawing.CreationDate Property
 The drawing creation date.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime CreationDate { get; }
Public ReadOnly Property CreationDate As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace